	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		#Область ОбработчикиСобытий
		
		Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
			
			Ответственный = Пользователи.ТекущийПользователь();
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ЗаполнитьНаОснованииРеализацииТоваровУслуг(ДанныеЗаполнения);
			КонецЕсли;
			
		КонецПроцедуры
		
		
		#КонецОбласти
		
		#Область СлужебныеПроцедурыИФункции
		
		Процедура ЗаполнитьНаОснованииРеализацииТоваровУслуг(ДанныеЗаполнения)
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Организация КАК Организация,
			|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
			|	РеализацияТоваровУслуг.Договор КАК Договор,
			|	РеализацияТоваровУслуг.Товары.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура КАК Номенклатура,
			|		Количество КАК Количество
			|	) КАК Товары
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Не Выборка.Следующий() Тогда
				Возврат;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			
			ТоварыОснования = Выборка.Товары.Выбрать();
			Пока ТоварыОснования.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
			КонецЦикла;
			
			Основание = ДанныеЗаполнения;
			
		КонецПроцедуры
		
		#КонецОбласти
		
	#КонецЕсли
	
	
	
	
