  Процедура ДополнитьФорму(Форма) Экспорт   
	  
	  ИмяФормы = Форма.ИмяФормы;
	  
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда  
		  ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма);   
		  ДобавитьПолеСогласованнаяСкидкаШапкаЛево(Форма);  
		  ДобавитьКомандуПересчитатьТаблицуПравоОтСогласованнаяСкидка(Форма); 
	  ИначеЕсли  ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда  	  
		  ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма);   
	  ИначеЕсли  ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда  	  
		  ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма);  
	  ИначеЕсли  ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		  ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);  
	  ИначеЕсли  ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда  	  
		  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 		  
	  КонецЕсли;    
	  
  КонецПроцедуры  
  
  
  Процедура  ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма) 
	  
	  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры 
  
  Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	  
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры   
  
    Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	  
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.Основание);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры 
  
  Процедура  ДобавитьПолеСогласованнаяСкидкаШапкаЛево(Форма)
	  
	  ПолеВвода = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка"; 
	  ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	  
  КонецПроцедуры  
  
  Процедура  ДобавитьКомандуПересчитатьТаблицуПравоОтСогласованнаяСкидка(Форма)
	  
	  Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	  Команда.Заголовок = "ПересчитатьТаблицу";
	  Команда.Действие = "КомандаПересчитатьТаблицу";
	  КомандаФормы = Форма.Элементы.Вставить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  КомандаФормы.ИмяКоманды ="ПересчитатьТаблицу"; 
	  КомандаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	  
  КонецПроцедуры     
  
  
